In [1]:
import numpy as np
from pandas import Series, DataFrame

In [2]:
import pandas as pd

In [3]:
df1 = DataFrame({'key':['x','y','z'],'data':range(3)})

In [4]:
df1

   data key
0     0   x
1     1   y
2     2   z

In [5]:
df2 = DataFrame({'group':[10,20]},index=['x','y'])

In [6]:
df2

   group
x     10
y     20

In [7]:
pd.merge(df1,df2,left_on='key',right_index=True)

   data key  group
0     0   x     10
1     1   y     20

In [9]:
df3 = DataFrame({'key1':['sf','sf','la','tx'],'key2':[10,20,30,40],'data_set':np.arange(4.)})

In [10]:
df3

   data_set key1  key2
0       0.0   sf    10
1       1.0   sf    20
2       2.0   la    30
3       3.0   tx    40

In [13]:
df4 = DataFrame(np.arange(10).reshape(5,2),
               index = [['la','tx','tx','la','la'],
                       [10,20,30,10,20]],columns= ['col_1','col_2'])

In [14]:
df4

       col_1  col_2
la 10      0      1
tx 20      2      3
   30      4      5
la 10      6      7
   20      8      9

In [15]:
pd.merge(df3,df4,left_on=['key1','key2'],right_index= True)

Empty DataFrame
Columns: [data_set, key1, key2, col_1, col_2]
Index: []

In [17]:
df1.join(df2)

   data key  group
0     0   x    NaN
1     1   y    NaN
2     2   z    NaN